{"basics":{"name":"Ayoosh Bansal","label":"","image":"","email":"ayooshb2@illinois.edu","phone":"(979) 587-3180","url":"https://ayooshbansal.com","summary":"","location":{},"profiles":[{}]},"work":[{"name":"Cyber Physical Systems Integration Lab","position":"Graduate Research Assistant","url":"https://cps-il.github.io/","startDate":"2017-08-00","endDate":"","summary":"Conducted diverse research within the realms of cyber-physical and real-time systems, enhancing functional safety, bolstering system security, and refining temporal predictability.","highlights":["Ongoing work on Synergistic Simplex system architecture that harnesses cooperation among safety- and mission-critical elements, as well as between perception and control modules, to enhance the safety and performance of autonomous ground and aerial vehicles.","Devised Perception Simplex, a system architecture for autonomous vehicles, providing verifiable collision avoidance in the presence of obstacle detection faults. Validated using software-in-the-loop simulation with ongoing real-world validation.","Recognizing the lack of context-aware metrics for object detection in autonomous driving, created Risk Ranked Recall.","Enhanced Linux Audit for real-time applications by creating Ellipsis. Harnessing the  inherent predictability of behaviors  in real-time applications, Ellipsis significantly curtails auditing data volume, >90% across a wide spectrum of real-time use cases, while preserving all security-relevant information.","Invented a novel memory type, Inner Non-Cacheable, Outer Cacheable, empowering real-time applications to selectively bypass cache coherence mechanisms and mitigate memory access latency fluctuations for shared data.","Helped design security-aware task scheduling for real-time applications and input prioritization schemes for object detection DNN."]},{"name":"NVIDIA","position":"System Software Engineer","url":"https://www.nvidia.com/","startDate":"2015-07-00","endDate":"2017-07-00","summary":"","highlights":["Developed device drivers to manage memory bandwidth allocations and participated in kernel bring-up on Tegra Parker SoC.","Developed the infrastructure to deploy Linux Kernel on the full-chip simulation platform for Tegra Xavier SoC.","Successfully led a cross-organizational effort to integrate the new full-chip simulation platform with a new regression testing infrastructure.","Mentored an internship project which overhauled simulator software startup process to create a seamless silicon like flow."]},{"name":"NVIDIA","position":"Automotive System Software Intern","url":"https://www.nvidia.com/","startDate":"2018-05-00","endDate":"2017-08-00","summary":"","highlights":["Analysed latency variability  stemming from processor architecture and helped verify proposed solutions."]},{"name":"NVIDIA","position":"Automotive System Software Intern","url":"https://www.nvidia.com/","startDate":"2020-05-00","endDate":"2020-08-00","summary":"","highlights":["Developed a hypervisor level latency  analysis system, made available to customers with real-time performance requirements."]},{"name":"NetApp","position":"Member of Technical Staff","url":"https://www.netapp.com/","startDate":"2010-07-00","endDate":"2013-07-00","summary":"","highlights":["Progressed through roles in CIFS server quality assurance, NFS server maintenance, and finally NFS server development over three years.","Resolved diverse customer issues and escalations, mitigating active disruptions. Conducted SSH CVE applicability analysis.","Awarded a monetary reward for the invention report aimed at optimizing stale mount point handling in NFS server implementations."]}],"volunteer":[],"education":[{"institution":"University of Illinois Urbana-Champaign","url":"https://cs.illinois.edu/","area":"","studyType":"PhD in Computer Science","startDate":"2017-08-00","endDate":"","score":"","courses":[]},{"institution":"University of Wisconsin-Madison","url":"https://engineering.wisc.edu/departments/electrical-computer-engineering/","area":"Electrical Engineering","studyType":"Master of Science in Electrical Engineering","startDate":"2013-09-00","endDate":"2015-05-00","score":"4/4","courses":[]},{"institution":"Birla Institute of Technology and Science Pilani, India","url":"https://www.bits-pilani.ac.in/pilani/","area":"Electrical and Electronics","studyType":"Bachelor of Engineering (Hons.) Electrical and Electronics","startDate":"2006-08-00","endDate":"2010-07-00","score":"8.6/10","courses":[]}],"awards":[{"title":"Best Paper Award","date":"2020","awarder":"IEEE Real-Time Systems Symposium","summary":""},{"title":"Saburo Muroga Endowed Fellowship","date":"2017","awarder":"University of Illinois Urbana-Champaign","summary":""},{"title":"Graduate Academic Achievement Award","date":"2015","awarder":"ISS, UW-Madison","summary":""},{"title":"Best Student Paper","date":"2015","awarder":"VLSI Design","summary":""}],"certificates":[],"publications":[],"skills":[],"languages":[],"interests":[],"references":[],"projects":[]}